#ifndef TRAINING_EVENTS_DATA_HPP
#define TRAINING_EVENTS_DATA_HPP

inline const std::map<std::string, TrainingEvent> TRAINING_EVENTS = {
    {"偷学", {"偷学", "在其他人摸鱼摆烂的时候，你却在偷偷学习。这样的学习方式也许会带来一些效果？你其实并不知道，你只是觉得在其他人休息的时候学习，会更有动力。这也是你引以为傲的一点。", {
            {"偷学被同学发现，被迫中断学习", {}, {}, "", {}, {}, "", 0},
            {"偷学被嘲讽：偷学照样考不过我，废物", {{"mood", -1}}, {}, "", {}, {}, "", 0},
            {"偷学了一些动态规划", {{"dp", 1}}, {}, "", {}, {}, "", 0},
            {"偷学了一些数据结构", {{"ds", 1}}, {}, "", {}, {}, "", 0},
            {"偷学了一些字符串", {{"string", 1}}, {}, "", {}, {}, "", 0},
            {"偷学了一些图论", {{"graph", 1}}, {}, "", {}, {}, "", 0},
            {"偷学了一些组合计数", {{"combinatorics", 1}}, {}, "", {}, {}, "", 0},
            {"偷学了一些文化课", {{"culture", 1}}, {}, "", {}, {}, "", 0}
        }, 1, false}},
    {"休息", {"休息", "竞赛生的生活非常忙碌，适当的休息也许可以让你更好地调整心态，迎接接下来的挑战。你期待着有个好梦，便躺在了床上。", {
            {"在床上躺着使你感到非常舒适，你很快就睡着了，至于虚幻的梦你醒来时已经记不清了", {{"mood", 1}}, {}, "", {}, {}, "", 0},
            {"在梦里你梦到了很多：喜欢的女孩，曾经的老友，还有你那未完成的梦想", {{"determination", 500}}, {}, "", {}, {}, "", 0},
            {"渐入梦境之时，你带上了你所有的决心……", {}, {}, "决心商店", {}, {}, "", 0},
            {"你被楼下的七八岁的小孩吵的无法安然入睡，这让你感到更加烦躁", {{"mood", -1}}, {}, "", {}, {}, "", 0}
        }, 1, false}},
    {"打隔膜", {"打隔膜", "竞赛生的快乐来源之一，当然是打隔膜。你和你的朋友们一起在机房打隔膜，在享受着游戏的乐趣的同时，又要避开教练的视线——你的学长曾因为在机房打隔膜被教练抓到，然后被罚写检讨并被轰出了机房。", {
            {"轻轻松松带飞全场，你感受到了游戏带来的快感", {{"mood", 2}}, {}, "", {}, {}, "", 0},
            {"经过激烈的厮杀后，勉强获胜——这确实缓解了一些压力", {{"mood", 1}}, {}, "", {}, {}, "", 0},
            {"打隔膜给你带来了必胜的决心：我在 OI 上也一定会赢！", {{"determination", 300}}, {}, "", {}, {}, "", 0},
            {"被对面虐，心态爆炸。连开了五把却怎么都赢不了，你开始怀疑自己的实力", {{"mood", -1}}, {}, "", {}, {}, "", 0},
            {"你在打隔膜时候被抓，跟学长一样地，被罚写检讨并被轰出了机房", {{"mood", -2}}, {}, "", {}, {}, "", 0}
        }, 1, false}},
    {"摸鱼", {"摸鱼", "日常训练给你带来了巨大的压力，你决定在训练期间暂时放松一下，舒缓一下心情。总不会真的有学习机器，连摸鱼的时间都没有吧？", {
            {"刷了会手机，时间就过去了", {}, {}, "", {}, {}, "", 0},
            {"去床上休息一下，缓解一下压力", {}, {}, "休息", {}, {}, "", 0},
            {"朋友都在旁边：为什么不一起打隔膜？", {}, {}, "打隔膜", {}, {}, "", 0}
        }, 3, false}},
    {"出游", {"出游", "竞赛生都是一些死宅，即使有空的时间也都是待在机房里。然而机房的气氛确实比较压抑，而且平时你也没有时间出去走走，那为什么不去感受一下外面的世界呢？", {
            {"你偶然遇上黄昏和晚霞：在另一个我不学 OI 的世界里，我此时会在做什么？", {}, {}, "", {}, {}, "", 0},
            {"你在湖边的咖啡厅遇到了一位学长，你回心转意决定跟他学习一会", {}, {}, "偷学", {}, {}, "", 0},
            {"原本只想开开心心地溜达，怎料天下大雨，你被淋成了落汤鸡", {{"mood", -1}}, {}, "", {}, {}, "", 0},
            {"后来你才知道：生活不只眼前的 OI，还有诗和远方", {{"mood", 1}}, {}, "", {}, {}, "", 0}
        }, 1, false}},
    {"遗忘", {"遗忘", "一些知识总会在不知不觉中遗忘，就如同历史的长河终究会把你我淹没。——希望大家一直记得我，希望大家永远忘了我。", {
            {"忘记动态规划", {{"dp", -1}}, {}, "", {}, {}, "", 0},
            {"忘记数据结构", {{"ds", -1}}, {}, "", {}, {}, "", 0},
            {"忘记字符串", {{"string", -1}}, {}, "", {}, {}, "", 0},
            {"忘记图论", {{"graph", -1}}, {}, "", {}, {}, "", 0},
            {"忘记组合计数", {{"combinatorics", -1}}, {}, "", {}, {}, "", 0}
        }, 3, false}},
    {"焦虑", {"焦虑", "长期的高压生活，你总会陷入焦虑。一次次的挫折后，你开始怀疑自己是否真的适合 OI，是否真的有天赋。你觉得自己不再是三年前那个充满梦想和决心的自己了。但是走到这一步，你已经没有退路了。", {
            {"有时候你开始思考人生的意义：我到底在追求什么？——可惜你找不到答案", {{"mood", -1}}, {}, "", {}, {}, "", 0},
            {"你开始轻微抑郁，你总觉得自己的努力没有意义，但也没有解决的办法，只能反复内耗", {{"mood", -2}}, {}, "", {}, {}, "", 0},
            {"在焦虑中，你开始选择遗忘，选择逃避，选择放弃", {}, {}, "遗忘", {}, {}, "", 0},
            {"你在一次次的焦虑中，变得更没有底气和决心", {{"determination", -500}}, {}, "", {}, {}, "", 0}
        }, 2, false}},
    {"长期训练", {"长期训练", "你很幸运地进入到了最好的高中，这里有着最好的师资力量，最好的学习氛围，最好的竞赛氛围。你开始进行长期训练，水平很快得到了提升。", {
            {"综合训练", {{"dp", 1}, {"ds", 1}, {"string", 1}, {"graph", 1}, {"combinatorics", 1}}, {}, "", {}, {}, "", 0},
            {"动态规划专项训练", {{"dp", 4}}, {}, "", {}, {}, "", 0},
            {"数据结构专项训练", {{"ds", 4}}, {}, "", {}, {}, "", 0},
            {"字符串专项训练", {{"string", 4}}, {}, "", {}, {}, "", 0},
            {"图论专项训练", {{"graph", 4}}, {}, "", {}, {}, "", 0},
            {"组合计数专项训练", {{"combinatorics", 4}}, {}, "", {}, {}, "", 0},
            {"文化课训练", {{"culture", 4}}, {}, "", {}, {}, "", 0}
        }, 5, false}},
    {"提升训练", {"提升训练", "人们只有会利用时间，才能真正地提升自己。你在碎片的时间里反复训练，水平也许会得到略微的提升——当然，你也可以选择摸鱼。", {
            {"动态规划专项训练", {{"dp", 1}}, {}, "", {}, {}, "", 0},
            {"数据结构专项训练", {{"ds", 1}}, {}, "", {}, {}, "", 0},
            {"字符串专项训练", {{"string", 1}}, {}, "", {}, {}, "", 0},
            {"图论专项训练", {{"graph", 1}}, {}, "", {}, {}, "", 0},
            {"组合计数专项训练", {{"combinatorics", 1}}, {}, "", {}, {}, "", 0},
            {"文化课训练", {{"culture", 1}}, {}, "", {}, {}, "", 0},
            {"训练不如摸鱼", {}, {}, "摸鱼", {}, {}, "", 0}
        }, 5, false}},
    {"比赛训练", {"比赛训练", "教练告诉你，比赛是检验你水平的最好方式。你开始参加比赛，你希望能在平时的比赛中找到自己的不足，并加以改进。这也许会给你正式的比赛带来帮助。", {
            {"按照教练推荐的，参加校内模拟赛", {}, {}, "模拟赛", {}, {}, "", 0},
            {"你注意到一些网站上也有比赛资源，也许可以打洛谷月赛", {}, {}, "月赛", {}, {}, "", 0},
            {"你偶然听说了 Codeforces，大家都说这里的题目质量很高，你决定去试一试", {}, {}, "Codeforces", {}, {}, "", 0},
            {"你偶然听说了 Atcoder，大家都说这里的题目质量很高，你决定去试一试", {}, {}, "Atcoder", {}, {}, "", 0},
            {"打比赛不如摸鱼", {}, {}, "摸鱼", {}, {}, "", 0}
        }, 3, false}},
    {"决心商店", {"决心商店", "在梦境中，你到了一个神秘的商店。商店的老板告诉你，只要你愿意，你就可以用你的决心来提升你的能力。但也许你需要先慎重地考虑一下，你到底需要什么。每次购买后，商品的价格都会上涨。", {
            {"思维提升", {{"thinking", 2}}, {}, "", {}, {}, "花费300点决心提升2点思维能力（下次购买费用+200）", 300},
            {"代码提升", {{"coding", 2}}, {}, "", {}, {}, "花费300点决心提升2点代码能力（下次购买费用+200）", 300},
            {"细心提升", {{"carefulness", 2}}, {}, "", {}, {}, "花费300点决心提升2点细心（下次购买费用+200）", 300},
            {"随机提升", {}, {"dp", "ds", "string", "graph", "combinatorics"}, "", {}, {}, "花费300点决心随机提升一项算法能力（下次购买费用+200）", 300},
            {"心态恢复", {{"mood", 2}}, {}, "", {}, {}, "花费500点决心提升2点心态（下次购买费用+100）", 500},
            {"全面提升", {{"dp", 1}, {"ds", 1}, {"string", 1}, {"graph", 1}, {"combinatorics", 1}}, {}, "", {}, {}, "花费1000点决心提升所有算法能力（下次购买费用+1000）", 1000},
            {"速度提升", {{"quickness", 1}}, {}, "", {}, {}, "花费1500点决心提升1点迅捷（下次购买费用+3000）", 1500},
            {"心理素质提升", {{"mental", 1}}, {}, "", {}, {}, "花费1500点决心提升1点心理素质（下次购买费用+5000）", 1500},
            {"放弃购买", {}, {}, "", {}, {}, "离开商店", 0}
        }, 5, true}},
    {"好比赛", {"比赛", "你对这场比赛的质量十分满意，这确实是一场出的相当不错的比赛。不过他相当大的难度，让你感到有些力不从心。", {
            {"比赛结束后，你发现这场比赛被 Unrated 了，你感到非常沮丧", {{"mood", -2}}, {}, "", {}, {}, "", 0},
            {"得到提升", {{"thinking", 2}}, {}, "", {}, {}, "", 0},
            {"得到提升", {{"coding", 2}}, {}, "", {}, {}, "", 0},
            {"得到提升", {{"ds", 2}}, {}, "", {}, {}, "", 0},
            {"得到提升", {{"dp", 2}}, {}, "", {}, {}, "", 0},
            {"得到提升", {{"string", 2}}, {}, "", {}, {}, "", 0},
            {"得到提升", {{"graph", 2}}, {}, "", {}, {}, "", 0},
            {"得到提升", {{"combinatorics", 2}}, {}, "", {}, {}, "", 0},
            {"在做比赛的时候，你更加坚定了你的决心", {{"determination", 500}}, {}, "", {}, {}, "", 0},
            {"你觉得这不是你的正常发挥，你还能做的更好", {}, {}, "焦虑", {}, {}, "", 0}
        }, 1, false}},
    {"正常比赛", {"比赛", "这场比赛的质量还算中等，并没有到值得夸赞的地步，但你也许能从中获得一些启发，也可能因为打的不够好而陷入焦虑。", {
            {"得到提升", {{"thinking", 1}}, {}, "", {}, {}, "", 0},
            {"得到提升", {{"coding", 1}}, {}, "", {}, {}, "", 0},
            {"在做比赛的时候，你更加坚定了你的决心", {{"determination", 200}}, {}, "", {}, {}, "", 0},
            {"做完比赛你改变了看法：你觉得做这种比赛就是在浪费时间", {{"mood", -1}}, {}, "", {}, {}, "", 0},
            {"做完比赛你只觉得平平无奇，并没有带来什么实际效果", {}, {}, "", {}, {}, "", 0},
            {"你觉得这不是你的正常发挥，你还能做的更好", {}, {}, "焦虑", {}, {}, "", 0}
        }, 1, false}},
    {"烂比赛", {"比赛", "你意识到这是一场极其糟糕的比赛！你坚持认为这场比赛就是垃圾中的王者，不仅浪费时间还搞人心态。", {
            {"比赛结束后，你发现这场比赛被 Unrated 了，你感到非常幸运", {{"mood", 2}}, {}, "", {}, {}, "", 0},
            {"尽管如此，你还是从中得到了一些提升", {{"coding", 1}}, {}, "", {}, {}, "", 0},
            {"尽管如此，你还是从中得到了一些提升", {{"ds", 1}}, {}, "", {}, {}, "", 0},
            {"建议不会出题就不要出比赛，出题人纯纯智障", {{"mood", -1}}, {}, "", {}, {}, "", 0},
            {"虽然很垃圾但也就这样，这不会影响什么事", {}, {}, "", {}, {}, "", 0},
            {"这是不是我的问题？如果真正的比赛也是这样的，那我该怎么办？", {}, {}, "焦虑", {}, {}, "", 0},
            {"我再也不会笑了", {{"determination", -300}}, {}, "", {}, {}, "", 0},
            {"做这场比赛不如去看奶龙大战暴暴龙", {{"determination", -500}}, {}, "", {}, {}, "", 0}
        }, 1, false}},
    {"娱乐时间", {"娱乐时间", "每天反复想题写题的生活一定是很压抑的，你决定利用好你的娱乐时间，做一些你觉得有意义的事情。", {
            {"你趁其他人娱乐，想要偷学一会", {}, {}, "偷学", {}, {}, "", 0},
            {"你困得不行了，为什么不休息一会", {}, {}, "休息", {}, {}, "", 0},
            {"年少不知摸鱼好", {}, {}, "摸鱼", {}, {}, "", 0},
            {"打隔膜是一种很好的娱乐方式", {}, {}, "打隔膜", {}, {}, "", 0},
            {"有空的时候多去看看世界，看看大自然", {}, {}, "出游", {}, {}, "", 0}
        }, 3, false}},
    {"模拟赛", {"模拟赛", "你参加了一场校内模拟赛...", {
            {"必须认真打好每一个部分分", {{"coding", 1}}, {}, "", {{"好比赛", 0.1}, {"正常比赛", 0.4}, {"烂比赛", 0.5}}, {}, "", 0},
            {"随便做做也许会稍微有点提升", {}, {"dp", "ds", "string", "graph", "combinatorics"}, "", {}, {}, "", 0},
            {"有这时间不如打打隔膜", {}, {}, "打隔膜", {}, {}, "", 0}
        }, 3, false}},
    {"月赛", {"月赛", "你参加了一场洛谷月赛...", {
            {"必须认真打好每一个部分分", {}, {}, "", {{"好比赛", 0.2}, {"正常比赛", 0.4}, {"烂比赛", 0.4}}, {}, "", 0},
            {"有这时间不如打打隔膜", {}, {}, "打隔膜", {}, {}, "", 0},
            {"边做边摸鱼真是一件美妙的事情", {}, {}, "摸鱼", {}, {}, "", 0},
            {"做了一半你决定摆了", {}, {}, "", {}, {}, "", 0}
        }, 3, false}},
    {"Codeforces", {"Codeforces", "你参加了一场 Codeforces 比赛...", {
            {"认真打好每一题，必须全神贯注！", {{"thinking", 1}}, {}, "", {{"好比赛", 0.4}, {"正常比赛", 0.4}, {"烂比赛", 0.2}}, {}, "", 0},
            {"随便做做，别把 rating 看的太重了", {}, {}, "", {}, {{0.5, {{"thinking", 1}}}, {0.5, {{"mood", -1}}}}, "", 0},
            {"你发现第一题做不出来，放弃就不会掉分", {}, {}, "", {}, {}, "", 0}
        }, 3, false}},
    {"Atcoder", {"Atcoder", "你参加了一场 Atcoder 比赛...", {
            {"认真打好每一题，必须全神贯注！", {{"thinking", 1}}, {}, "", {{"好比赛", 0.4}, {"正常比赛", 0.3}, {"烂比赛", 0.3}}, {}, "", 0},
            {"随便做做，别把 rating 看的太重了", {}, {}, "", {}, {{0.6, {{"thinking", 1}}}, {0.4, {{"mood", -1}}}}, "", 0},
            {"你发现第一题做不出来，放弃也会掉分", {{"mood", -1}}, {}, "", {}, {}, "", 0}
        }, 3, false}},
    {"赛前一天", {"赛前一天", "不知不觉已经到了比赛前的最后一天，你不再希望提升你的能力，你只祈祷在比赛中取得一个好成绩——那么现在做什么，才能带来好运呢？", {
            {"缓和心态", {{"mood", 7}}, {}, "", {}, {}, "调整心态到恰好为 7", 0},
            {"放松一下", {{"mood", 2}}, {}, "", {}, {}, "心态+2", 0},
            {"渐入梦境", {}, {}, "决心商店", {}, {}, "进入决心商店", 0},
            {"提升训练", {}, {}, "提升训练", {}, {}, "进行提升训练", 0},
            {"休息一下", {}, {}, "休息", {}, {}, "休息", 0}
        }, 5, false}},
    {"步入高二", {"步入高二", "时光飞逝，转眼间你已经升入高二。新的学年带来了新的挑战，你需要在OI和文化课之间找到平衡。你的决心依然坚定，但你也意识到时间变得更加宝贵。", {
            {"专注OI", {{"determination", 500}, {"culture", -2}}, {}, "", {}, {}, "你决定继续专注于OI，为接下来的比赛做准备", 0},
            {"均衡发展", {{"determination", 200}, {"culture", 2}, {"mood", 1}}, {}, "", {}, {}, "你试图在OI和文化课之间找到平衡", 0},
            {"感到迷茫", {{"determination", -200}, {"mood", -2}}, {}, "焦虑", {}, {}, "面对繁重的学业压力，你开始质疑自己的选择", 0},
            {"重整旗鼓", {{"determination", 300}, {"thinking", 1}, {"coding", 1}}, {}, "", {}, {}, "新的学年给了你新的动力，你决定以更好的状态面对挑战", 0}
        }, 2, false}}
};

#endif // TRAINING_EVENTS_DATA_HPP
